flensburger88/esp8266windstation/src/esp8266-WindStation.cpp
#include <FS.h> //this needs to be first, or it all crashes and burns...

#include <DHT.h> //https://github.com/adafruit/DHT-sensor-library
#include <ESP8266WiFi.h>
#include <PubSubClient.h>
#include <Ticker.h>
#include <ESP8266WebServer.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClientSecure.h>
#include <ESP8266httpUpdate.h>
#include <WiFiManager.h> //https://github.com/tzapu/WiFiManager
#include <DNSServer.h>
#include <ArduinoJson.h> //https://github.com/bblanchon/ArduinoJson
#include <TimeLib.h>
#include "methods.h"

#define LEN_MQTTSERVER 60
#define LEN_MQTTPORT 6
#define LEN_MQTTUSER 40
#define LEN_MQTTPASS 40
#define LEN_KCWIND 4
#define LEN_WINDUGUUID 30
#define LEN_WINDGUTUPASS 20
#define LEN_WINDYKEY 128
#define LEN_VANEOFFSET 4
#define LEN_VANEMAXADC 5
#define LEN_WINDYAPP_SECRET 15 //?
#define LEN_WINDYAPP_ID 5      //?

char mqtt_server[LEN_MQTTSERVER];
char mqtt_port[LEN_MQTTPORT] = "1883";
char mqtt_user[LEN_MQTTUSER];
char mqtt_pass[LEN_MQTTPASS];
char kc_wind[LEN_KCWIND] = "0";
char windguru_uid[LEN_WINDUGUUID];
char windguru_pass[LEN_WINDGUTUPASS];
char windy_key[LEN_WINDYKEY];
char vaneOffset[LEN_VANEOFFSET] = "0";
char vaneMaxADC[LEN_WINDYAPP_ID] = "1023"; // ADC range for input voltage 0..1V
char windyAppSecret[LEN_WINDYAPP_SECRET] = "";
char windyAppID[LEN_WINDYAPP_ID] = "";

WiFiManagerParameter custom_mqtt_server("server", "mqtt server", mqtt_server, LEN_MQTTSERVER);
WiFiManagerParameter custom_mqtt_port("port", "mqtt port", mqtt_port, LEN_MQTTPORT);
WiFiManagerParameter custom_mqtt_user("user", "mqtt user", mqtt_user, LEN_MQTTUSER);
WiFiManagerParameter custom_mqtt_pass("pass", "mqtt password", mqtt_pass, LEN_MQTTPASS);
WiFiManagerParameter custom_kc_wind("kc_wind", "wind correction 1-999%", kc_wind, LEN_KCWIND);
WiFiManagerParameter custom_windguru_uid("windguru_uid", "windguru station UID", windguru_uid, LEN_WINDUGUUID);
WiFiManagerParameter custom_windguru_pass("windguru_pass", "windguru pass", windguru_pass, LEN_WINDGUTUPASS);
WiFiManagerParameter custom_windy_key("windy_key", "windy api key", windy_key, LEN_WINDYKEY);
WiFiManagerParameter custom_vaneMaxADC("vaneMaxADC", "Max ADC value 1-1024", vaneMaxADC, LEN_VANEMAXADC);
WiFiManagerParameter custom_vaneOffset("vaneOffset", "Wind vane offset 0-359", vaneOffset, LEN_VANEOFFSET);
WiFiManagerParameter custom_windyAppId("windyAppID", "WindyApp user Id", windyAppID, LEN_WINDYAPP_ID);
WiFiManagerParameter custom_windyAppSecret("windyAppSecret", "Windy App secret", windyAppSecret, LEN_WINDYAPP_SECRET);

String st;
String content;
int statusCode;

int debouncing_time = 10000; // time in microseconds!
unsigned long last_micros = 0;
volatile int windimpulse = 0;

#define VERSION "v1.92 OTA"
#define VERSIONINFO "\n\n----------------- GAYIK Wind Station v1.92 OTA -----------------"
#define NameAP "WindStationAP"

#define OTA_CHECK_MINUTES 30

// #define FirmwareURL "http://gayikweatherstation.blob.core.windows.net/firmware/esp8266-WindStation.ino.generic.bin" // URL of firmware file for http OTA update by secret MQTT command "flash"
#define FirmwareURL ""
#define MQTT_CONNECT_RETRIES 5

// #define NightSleepMODE                                       // Enable deep-sleep only in night time
#if defined(DeepSleepMODE) || defined(NightSleepMODE) // Deep-sleep mode power consumption ~6mAh (3*5=15sec work/5 min sleep), instead ~80mAh in default "Always On" mode

#define SLEEPNIGHT 10
#define TIMEZONE 2        // UTC offset
#define TIMEMORNING 5     // night end at...
#define TIMEEVENING 20    // night start at...
#include "NtpClientLib.h" //https://github.com/gmag11/NtpClient
#endif

// #define MOSFETPIN       15                                   // Experemental!!! GPIO15 (D8 for NodeMcu). MosFET's gate pin for power supply sensors, off for current drain minimize. Not connect this GPIO directly to sensors you burning it! The maximum source current of GPIO is about 12mA

#define BUTTON 4   // optional, GPIO4 for Witty Cloud. GPIO0/D3 for NodeMcu (Flash) - not work with deepsleep, set 4!
#define LED 2      // GPIO2 for Witty Cloud. GPIO16/D0 for NodeMcu - not work with deepsleep, set 2!
#define DHTPIN D5  // GPIO14 (D5 for NodeMcu)
#define WINDPIN D1 // GPIO5 (D1 for NodeMcu)

#define MQTT_TOPIC "windpoint" // mqtt topic (Must be unique for each device)
#define MQTT_TOPICm "windpoint/m"
#define MQTT_TOPICo "windpoint/o"

#ifdef DHTPIN
#define DHTTYPE DHT11     // DHT11, DHT22, DHT21, AM2301
DHT dht(DHTPIN, DHTTYPE); //
#endif

bool sendStatus = true;
bool sensorReport = false;
bool resetWind = true;
bool firstRun = true;

int errors_count = 0;
int kUpdFreq = 1; // minutes
bool firstWindReceived = 0;

const float kKnots = 1.94;     // m/s to knots conversion
#define windMeasurePeriodSec 3 // wind measurement period in seconds 1-10sec / 3!

float dhtH, dhtT, windMS = 0;
float WindMax = 0, WindAvr = 0, WindMin = 100;

String str;

unsigned long TTasks;
unsigned long secTTasks;
unsigned long count_btn = 0;

float windSpeed = 0; // Wind speed (mph)

volatile unsigned long Rotations;         // cup rotation counter used in interrupt routine
volatile unsigned long ContactBounceTime; // Timer to avoid contact bounce in interrupt routine
int vane_value;                           // raw analog value from wind vane
int Direction;                            // translated 0 - 360 direction
int CalDirection;                         // converted value with offset applied

WiFiClient wifiClient;
PubSubClient mqttClient(wifiClient);
#define MSG_BUFFER_SIZE (50)
char msg_buff[MSG_BUFFER_SIZE];

Ticker btn_timer;

// config for rest service
WiFiManager wifiManager;

//--------------------------------START OF CODE SECTION--------------------------------------------------------
unsigned long startTime = 0;
//-------------------------------------------------------------------------------------------------------------
////////////////////////////////////Get wind speed  /////////////////////////////////////////////////////////
//-------------------------------------------------------------------------------------------------------------
void getWindSpeed(void)
{
  if (startTime == 0)
  {
    Rotations = 0; // Set Rotations count to 0 ready for calculations
    startTime = millis();
  }

  long duration = millis() - startTime;
  if (duration > (windMeasurePeriodSec * 1000)) // 3 Seconds after the start of the measurement
  {
    /* convert to mp/h using the formula V=P(2.25/T)
     V = P(2.25/3) = P * 0.75       V - speed in mph,  P - pulses per sample period, T - sample period in seconds
     V = P(2.25/(duration/1000))  -> V = P * (2,25 * 1000) / duration -> P * 2250 / duration
      */
    // windSpeed = Rotations * 0.75; // 3 seconds
    windSpeed = Rotations * 2250 / duration; // duration millis
    Rotations = 0;                           // Reset count for next sample

    if (windSpeed > WindMax)
    {
      WindMax = windSpeed;
    }
    if (WindMin > windSpeed)
    {
      WindMin = windSpeed;
    }

