flensburger88/esp8266windstation/src/esp8266-WindStation.cpp
    WindAvr = (WindMax + WindMin) * 0.5; // average wind speed mph per 10 minutes

    firstWindReceived = true;

    Rotations = 0; // Set Rotations count to 0 ready for calculations
    startTime = millis();
    Serial.print("found wind (mp/h): ");
    Serial.print(windSpeed);
    Serial.print("\tendured (ms): ");
    Serial.println(duration);
  }
}

// This is the function that the interrupt calls to increment the rotation count
//-------------------------------------------------------------------------------------------------------------
////////////////////////////////////ISR rotation//////////////////////////////////////////////////////////////
//-------------------------------------------------------------------------------------------------------------
void IRAM_ATTR isr_rotation()
{
  if ((millis() - ContactBounceTime) > 15)
  { // debounce the switch contact.
    Rotations++;
    ContactBounceTime = millis();
  }
}
// Get Wind Direction
//-------------------------------------------------------------------------------------------------------------
/////////////////////////////////// Wind direction ////////////////////////////////////////////////////////////
//-------------------------------------------------------------------------------------------------------------
void getWindDirection(void)
{
  vane_value = analogRead(A0);                              // read sensor data
  Direction = map(vane_value, 0, atoi(vaneMaxADC), 0, 359); // map it to 360 degrees
  CalDirection = Direction + atoi(vaneOffset);              // factor in the offset degrees

  // Fix degrees:
  if (CalDirection > 360)
    CalDirection = CalDirection - 360;

  if (CalDirection < 0)
    CalDirection = CalDirection + 360;
}

// Convert MPH to Knots
float getKnots(float speed)
{
  return speed * 0.868976; // knots 0.868976;
}
// Convert MPH to m/s
float getms(float speed)
{
  return speed * 0.44704; // metric m/s 0.44704;;
}

unsigned long nextOTUpdate = 0;
void flashOTA(bool force)
{
  if (nextOTUpdate == 0)
  {
    nextOTUpdate = millis() + (OTA_CHECK_MINUTES * 60 * 1000);
  }

  if (!force && millis() < nextOTUpdate)
  {
    return;
  }
  nextOTUpdate = 0;

  // disabling the ota update
  if (String(FirmwareURL).length() == 0)
  {
    Serial.println("OTA Update disabled");
    return;
  }

  Serial.println("HTTP_UPDATE FILE: " + String(FirmwareURL));
  // noInterrupts();
  detachInterrupt(digitalPinToInterrupt(WINDPIN));
  WiFiClient client;

  ESPhttpUpdate.setLedPin(LED, LOW);
  t_httpUpdate_return ret = ESPhttpUpdate.update(client, FirmwareURL);
  attachInterrupt(WINDPIN, isr_rotation, FALLING);

  switch (ret)
  {
  case HTTP_UPDATE_FAILED:
    Serial.printf("HTTP_UPDATE_FAILD Error (%d): %s\n", ESPhttpUpdate.getLastError(), ESPhttpUpdate.getLastErrorString().c_str());
    ESP.restart();
    break;
  case HTTP_UPDATE_NO_UPDATES:
    Serial.println("HTTP_UPDATE_NO_UPDATES");
    break;
  case HTTP_UPDATE_OK:
    Serial.println("HTTP_UPDATE_OK");
    break;
  }
}

//-------------------------------------------------------------------------------------------------------------
/////////////////////////////////// MQTT Received message callback ////////////////////////////////////////////
//-------------------------------------------------------------------------------------------------------------
void callback(char *topic, byte *payload, unsigned int length)
{
  String payload_string = String((char *)payload);
  payload_string = payload_string.substring(0, length);
  Serial.println("MQTT Topic: " + String(topic) + " MQTT Payload: " + payload_string);
  if (payload_string == "stat")
  {
  }
  else if (payload_string == "reset")
  {
    errors_count = 100;
  }
  else if (payload_string == "sensor")
  {
    if (minute() < 10)
      mqttClient.publish("debug", (String(hour()) + ":0" + String(minute())).c_str());
    else
      mqttClient.publish("debug", (String(hour()) + ":" + String(minute())).c_str());
    sensorReport = true;
  }
  else if (payload_string == "adc")
  {
    mqttClient.publish("debug", ("ADC:" + String(analogRead(A0)) + " error:" + String(errors_count)).c_str());
  }
  else if (payload_string == "flash")
  {
    flashOTA(true);
  }
  else
  {
    // We check the topic in order to see what kind of payload we got:
    str = payload_string;
    int i = atoi(str.c_str());
    if ((i >= 0) && (i < 9999))
    {
      if (String(topic) == MQTT_TOPIC) // we got kc_wind?
        strcpy(kc_wind, String(i).c_str());
      else if (String(topic) == MQTT_TOPICm) // we got vaneMaxADC?
        strcpy(vaneMaxADC, String(i).c_str());
      else if (String(topic) == MQTT_TOPICo) // we got vaneOffset?
        strcpy(vaneOffset, String(i).c_str());

      mqttClient.publish("debug", "saving config");
      Serial.println("saving config");
      DynamicJsonDocument json(1024);
      json["mqtt_server"] = mqtt_server;
      json["mqtt_port"] = mqtt_port;
      json["mqtt_user"] = mqtt_user;
      json["mqtt_pass"] = mqtt_pass;
      json["kc_wind"] = kc_wind;
      json["windguru_uid"] = windguru_uid;
      json["windguru_pass"] = windguru_pass;
      json["windy_key"] = windy_key;
      json["vaneMaxADC"] = vaneMaxADC;
      json["vaneOffset"] = vaneOffset;

      File configFile = SPIFFS.open("/config.json", "w");
      if (!configFile)
      {
        Serial.println("failed to open config file for writing");
      }

      serializeJson(json, Serial);
      serializeJson(json, configFile);
      configFile.close();

      sendStatus = true;
    }
  }
}

// callback notifying us of the need to save config
void saveConfigCallback()
{
  Serial.println("Should save config");

  // read updated parameters
  strcpy(mqtt_server, custom_mqtt_server.getValue());
  strcpy(mqtt_port, custom_mqtt_port.getValue());
  strcpy(mqtt_user, custom_mqtt_user.getValue());
  strcpy(mqtt_pass, custom_mqtt_pass.getValue());
  strcpy(kc_wind, custom_kc_wind.getValue());
  strcpy(windguru_uid, custom_windguru_uid.getValue());
  strcpy(windguru_pass, custom_windguru_pass.getValue());
  strcpy(windy_key, custom_windy_key.getValue());
  strcpy(vaneMaxADC, custom_vaneMaxADC.getValue());
  strcpy(vaneOffset, custom_vaneOffset.getValue());
  strcpy(windyAppID, custom_windyAppId.getValue());
  strcpy(windyAppSecret, custom_windyAppSecret.getValue());

  // save the custom parameters to FS

