flensburger88/esp8266windstation/src/esp8266-WindStation.cpp
  Serial.println("saving config");
  DynamicJsonDocument json(1024);
  json["mqtt_server"] = mqtt_server;
  json["mqtt_port"] = mqtt_port;
  json["mqtt_user"] = mqtt_user;
  json["mqtt_pass"] = mqtt_pass;
  json["kc_wind"] = kc_wind;
  json["windguru_uid"] = windguru_uid;
  json["windguru_pass"] = windguru_pass;
  json["windy_key"] = windy_key;
  json["vaneMaxADC"] = vaneMaxADC;
  json["vaneOffset"] = vaneOffset;
  json["windyAppID"] = windyAppID;
  json["windyAppSecret"] = windyAppSecret;

  File configFile = SPIFFS.open("/config.json", "w");
  if (!configFile)
  {
    Serial.println("failed to open config file for writing");
  }

  serializeJson(json, Serial);
  serializeJson(json, configFile);
  configFile.close();
  // end save parameters
  ESP.restart();
}

void setupSpiffs()
{
  // read configuration from FS json
  Serial.println("mounting FS...");

  if (SPIFFS.begin())
  {
    Serial.println("mounted file system");
    if (SPIFFS.exists("/config.json"))
    {
      // file exists, reading and loading
      Serial.println("reading config file");
      File configFile = SPIFFS.open("/config.json", "r");
      if (configFile)
      {
        Serial.println("opened config file");

        DynamicJsonDocument json(1024);
        DeserializationError error = deserializeJson(json, configFile);
        if (error)
        {
          Serial.print(F("deserializeJson() failed with code "));
          Serial.println(error.c_str());
        }
        else
        {
          serializeJson(json, Serial);
          Serial.println("\nparsed json");
          strcpy(mqtt_server, json["mqtt_server"] | mqtt_server);
          strcpy(mqtt_port, json["mqtt_port"] | mqtt_port);
          strcpy(mqtt_user, json["mqtt_user"] | mqtt_user);
          strcpy(mqtt_pass, json["mqtt_pass"] | mqtt_pass);
          strcpy(kc_wind, json["kc_wind"] | kc_wind);
          strcpy(windguru_uid, json["windguru_uid"] | windguru_uid);
          strcpy(windguru_pass, json["windguru_pass"] | windguru_pass);
          strcpy(windy_key, json["windy_key"] | windy_key);
          strcpy(vaneMaxADC, json["vaneMaxADC"] | vaneMaxADC);
          strcpy(vaneOffset, json["vaneOffset"] | vaneOffset);
          strcpy(windyAppID, json["windyAppID"] | windyAppID);
          strcpy(windyAppSecret, json["windyAppSecret"] | windyAppSecret);
          Serial.println("\nAfter Reading");

          custom_mqtt_server.setValue(mqtt_server, LEN_MQTTSERVER);
          custom_mqtt_port.setValue(mqtt_port, LEN_MQTTPORT);
          custom_mqtt_user.setValue(mqtt_user, LEN_MQTTUSER);
          custom_mqtt_pass.setValue(mqtt_pass, LEN_MQTTPASS);
          custom_kc_wind.setValue(kc_wind, LEN_KCWIND);
          custom_windguru_uid.setValue(windguru_uid, LEN_WINDUGUUID);
          custom_windguru_pass.setValue(windguru_pass, LEN_WINDGUTUPASS);
          custom_windy_key.setValue(windy_key, LEN_WINDYKEY);
          custom_vaneMaxADC.setValue(vaneMaxADC, LEN_VANEMAXADC);
          custom_vaneOffset.setValue(vaneOffset, LEN_VANEOFFSET);
          custom_windyAppId.setValue(windyAppID, LEN_WINDYAPP_ID);
          custom_windyAppSecret.setValue(windyAppSecret, LEN_WINDYAPP_SECRET);
        }
      }
    }
  }
  else
  {
    Serial.println("failed to mount FS");
  }
  // end read configuration
}
void connectMQTT()
{

  if (String(mqtt_server).length() == 0)
  {
    Serial.println("Mqtt Broker not configured");
  }
  else
  {
    short kRetries = MQTT_CONNECT_RETRIES;
    Serial.print("Connecting to ");
    Serial.print(mqtt_server);
    Serial.print(" Broker . .");
    delay(500);
    mqttClient.setServer(mqtt_server, atoi(mqtt_port));
    mqttClient.setSocketTimeout(70);
    mqttClient.setKeepAlive(70);
    while (!mqttClient.connected() && kRetries--)
    {
      String str = String(ESP.getChipId(), HEX);
      mqttClient.connect(str.c_str(), mqtt_user, mqtt_pass);
      Serial.print(" .");
      delay(1000);
    }
    if (mqttClient.connected())
    {
      Serial.println(" DONE");
      Serial.println("\n----------------------------  Logs  ----------------------------");
      Serial.println();
      mqttClient.subscribe(MQTT_TOPIC);
      mqttClient.subscribe(MQTT_TOPICm);
      mqttClient.subscribe(MQTT_TOPICo);
      blinkLED(LED, 40, 8);
      digitalWrite(LED, LOW);
      mqttClient.publish("start", ("Version:" + String(VERSION)).c_str());
    }
    else
    {
      Serial.println(" FAILED!");
      Serial.println("\n----------------------------------------------------------------");
      Serial.println();
      digitalWrite(LED, HIGH);
    }
  }
}

void setup()
{
  Serial.begin(9600);
  Serial.println(VERSIONINFO);
  Serial.print("\nESP ChipID: ");
  Serial.println(ESP.getChipId(), HEX);

  // clean FS, erase config.json in case of damaged file
  // SPIFFS.format();

  Rotations = 0; // Set Rotations to 0 ready for calculations

  setupSpiffs();

  // The extra parameters to be configured (can be either global or just in the setup)
  // After connecting, parameter.getValue() will get you the configured value
  // id/name placeholder/prompt default length

#ifdef MOSFETPIN
  pinMode(MOSFETPIN, OUTPUT);
  digitalWrite(MOSFETPIN, HIGH);
#endif

  pinMode(LED, OUTPUT);
  pinMode(BUTTON, INPUT);
  pinMode(WINDPIN, INPUT_PULLUP);
  digitalWrite(LED, HIGH);

  firstRun = true;
  btn_timer.attach(0.05, button);

  mqttClient.setCallback(callback);

  wifiManager.setSaveConfigCallback(saveConfigCallback); // set config save notify callback

#ifdef DeepSleepMODE
  wifiManager.setTimeout(60); // sets timeout until configuration portal gets turned off
#else
  wifiManager.setTimeout(180); // sets timeout until configuration portal gets turned off
#endif

  // add all your parameters here
  wifiManager.addParameter(&custom_mqtt_server);
  wifiManager.addParameter(&custom_mqtt_port);
  wifiManager.addParameter(&custom_mqtt_user);
  wifiManager.addParameter(&custom_mqtt_pass);
  wifiManager.addParameter(&custom_kc_wind);
  wifiManager.addParameter(&custom_windguru_uid);
  wifiManager.addParameter(&custom_windguru_pass);
  wifiManager.addParameter(&custom_windy_key);
  wifiManager.addParameter(&custom_vaneMaxADC);
  wifiManager.addParameter(&custom_vaneOffset);
  wifiManager.addParameter(&custom_windyAppId);
  wifiManager.addParameter(&custom_windyAppSecret);

