flensburger88/esp8266windstation/src/esp8266-WindStation.cpp
  WiFi.mode(WIFI_STA); // explicitly set mode, esp defaults to STA+AP
  WiFi.setSleepMode(WIFI_NONE_SLEEP);

  if (!wifiManager.autoConnect(NameAP))
  {
    Serial.println("failed to connect and hit timeout");
    delay(1000);
    // reset and try again, or maybe put it to deep sleep

#if defined(DeepSleepMODE) || defined(NightSleepMODE)
    ESP.deepSleep(SLEEPNIGHT * 60000000); // Sleep for x* minute(s)
#endif
  }

  Serial.print("\nChecking Wifi Connection");
  if ((WiFi.status() != WL_CONNECTED))
  {
    Serial.println(" Not Connected to Wifi - Restarting");
    ESP.restart();
    delay(5000);
    return;
  }

  if (WiFi.status() == WL_CONNECTED)
  {
#if defined(DeepSleepMODE) || defined(NightSleepMODE)
    NTP.begin("pool.ntp.org", TIMEZONE, true); // ntpServerName, NTP_TIMEZONE, daylight = false
    NTP.setInterval(10, 600);                  // ShortInterval, LongInterval
#endif
    Serial.println(" DONE");
    Serial.print("IP Address is: ");
    Serial.println(WiFi.localIP());
    Serial.print("macAddress is: ");
    Serial.println(WiFi.macAddress());
    connectMQTT();
  }

  // TODO: Start Webserver to modify parameters in runtime
  wifiManager.stopConfigPortal();
  wifiManager.startWebPortal();

  attachInterrupt(WINDPIN, isr_rotation, FALLING);
}

void loop()
{
  wifiManager.process();

  flashOTA(false);
  mqttClient.loop();
  timedTasks();
  checkStatus();
  if (sensorReport)
  {
    getSensors();
  }
  delay(50);
}

void blinkLED(int pin, int duration, int n)
{
  for (int i = 0; i < n; i++)
  {
    digitalWrite(pin, HIGH);
    delay(duration);
    digitalWrite(pin, LOW);
    delay(duration);
  }
}

void button()
{
  if (!digitalRead(BUTTON))
  {
    count_btn++;
  }
  else
  {
    if (count_btn > 1 && count_btn <= 40)
    {
      digitalWrite(LED, !digitalRead(LED));
      sendStatus = true;
    }
    else if (count_btn > 40)
    {
      Serial.println("\n\nESP8266 Rebooting . . . . . . . . Please Wait");
      errors_count = 100;
    }
    count_btn = 0;
  }
}

void checkMQTTConnection()
{
  if (WiFi.status() != WL_CONNECTED)
  {
    errors_count = errors_count + 10;
    Serial.println("WiFi connection . . . LOST errors_count = " + String(errors_count));
  }
  else if (String(mqtt_server).length() == 0)
  {
    Serial.println("mqtt broker connection . . . ..not configured");
  }
  else if (mqttClient.connected())
  {
    Serial.println("mqtt broker connection . . . . . . . . . . OK");
  }
  else
  {
    errors_count = errors_count + 5;
    Serial.println("mqtt broker connection. . . . LOST errors_count = " + String(errors_count));
  }
}

void checkStatus()
{
  if (sendStatus)
  {
    mqttClient.publish("kc_wind", String(kc_wind).c_str());
    mqttClient.publish("adc", ("{\"ADC\":" + String(analogRead(A0)) + ", " + "\"MaxADC\":" + String(vaneMaxADC) + ", " + "\"Offset\":" + String(vaneOffset) + "}").c_str());
    sendStatus = false;
  }
  if (errors_count >= 100)
  {
    blinkLED(LED, 400, 4);
    ESP.restart();
    delay(500);
  }
}

void getSensors()
{
  String pubString;
#ifdef DHTPIN
  Serial.print("DHT read . . . . . . . . . . . . . . . . . ");
  dhtH = dht.readHumidity();
  dhtT = dht.readTemperature();
  if (digitalRead(LED) == LOW)
  {
    blinkLED(LED, 100, 1);
  }
  else
  {
    blinkLED(LED, 100, 1);
    digitalWrite(LED, HIGH);
  }
  if (isnan(dhtH) || isnan(dhtT))
  {
    if (mqttClient.connected())
      mqttClient.publish("debug", "DHT READ ERROR");
    Serial.println("ERROR");
  }
  else
  {
    pubString = "{\"Temp\": " + String(dhtT) + ", " + "\"Humidity\": " + String(dhtH) + "}";
    pubString.toCharArray(msg_buff, pubString.length() + 1);
    if (mqttClient.connected())
      mqttClient.publish("temp", msg_buff);
    Serial.println("OK");
  }
#endif

#ifdef DeepSleepMODE
  if (mqttClient.connected())
    mqttClient.publish("debug", "ADC:" + String(a0) + " " + NTP.getTimeDateString());
#endif

  if (firstWindReceived)
  { // already made measurement wind power
    pubString = "{\"Min\": " + String(WindMin, 2) + ", " + "\"Avr\": " + String(WindAvr) + ", " + "\"Max\": " + String(WindMax, 2) + ", " + "\"Dir\": " + String(CalDirection) + "}";
    pubString.toCharArray(msg_buff, pubString.length() + 1);
    if (mqttClient.connected())
      mqttClient.publish("wind", msg_buff);
    Serial.print(" Wind Min: " + String(getKnots(WindMin), 2) + " Avr: " + String(getKnots(WindAvr), 2) + " Max: " + String(getKnots(WindMax), 2) + " Dir: " + String(CalDirection) + " (offset:" + String(vaneOffset) + ") ");
  }
  resetWind = true;
  sensorReport = false;
}

void timedTasks()
{
  getWindSpeed();
  getWindDirection();

  // kUpdFreq minutes timer
  if ((millis() > TTasks + (kUpdFreq * 60000)) || (millis() < TTasks))
  {
    if ((WindMax > 2) && (WindMin == WindMax))
      errors_count = errors_count + 25; // check for freeze CPU
    TTasks = millis();
    checkMQTTConnection();
    // sensorReport = true;
    getSensors();
    SendData();
  }
}

void SendData()
{

  if (!SendToWindguru())
    errors_count++;

  if (!SendToWindyCom())
    errors_count++;

  if (!SendToWindyApp())
    errors_count++;

  ResetCounters();
}

void ResetCounters()
{
  WindMax = 0;
  WindMin = 100;
}

//-------------------------------------------------------------------------------------------------------------
/////////////////////////////////// SEND TO WINDGURU //////////////////////////////////////////////////////////
//-------------------------------------------------------------------------------------------------------------
bool SendToWindguru()
{ // send info to windguru.cz
  WiFiClient client;
  HTTPClient http; // must be declared after WiFiClient for correct destruction order, because used by http.begin(client,...)
  String getData = "", Link;
  unsigned long time;

  if (WiFi.status() != WL_CONNECTED)
  {
    Serial.println("wi-fi connection failed");
    return false; // fail;
  }
  else if (String(windguru_uid).length() == 0)
  {
    Serial.println("\nwindguru uid not configured");
    return true; // not an failure / just not configured;
  }
  else
  { // Check WiFi connection status
    Link = "http://www.windguru.cz/upload/api.php?";
    time = millis();

