flensburger88/esp8266windstation/src/esp8266-WindStation.cpp
    //--------------------------md5------------------------------------------------
    MD5Builder md5;
    md5.begin();
    md5.add(String(time) + String(windguru_uid) + String(windguru_pass));
    md5.calculate();
    if (firstWindReceived)
      getData = "uid=" + String(windguru_uid) + "&salt=" + String(time) + "&hash=" + md5.toString() + "&interval=" + String(kUpdFreq) + "&wind_min=" + String(getKnots(WindMin), 2) + "&wind_avg=" + String(getKnots(WindAvr), 2) + "&wind_max=" + String(getKnots(WindMax), 2);
    // wind_direction     wind direction as degrees (0 = north, 90 east etc...)
    getData = getData + "&wind_direction=" + String(CalDirection);
#ifdef DHTPIN
    if (!isnan(dhtT))
      getData = getData + "&temperature=" + String(dhtT);
    if (!isnan(dhtH))
      getData = getData + "&rh=" + String(dhtH);
#endif
    Serial.println(Link + getData);
    http.begin(client, Link + getData); // Specify request destination
    int httpCode = http.GET();          // Send the request
    if (httpCode > 0)
    {                                    // Check the returning code
      String payload = http.getString(); // Get the request response payload
      Serial.println(payload);           // Print the response payload
      if (mqttClient.connected() && (payload != "OK"))
        mqttClient.publish("debug", payload.c_str());
    }
    http.end(); // Close connection
  }

  return true; // done
}

//-------------------------------------------------------------------------------------------------------------
//////////////////////////////////// SEND TO WINDY ////////////////////////////////////////////////////////////
//-------------------------------------------------------------------------------------------------------------
// https://stations.windy.com/pws/update/XXX-API-KEY-XXX?winddir=230&windspeedmph=12&windgustmph=12&tempf=70&rainin=0&baromin=29.1&dewptf=68.2&humidity=90
// We will be displaying data in 5 minutes steps. So, it's not nessary send us data every minute, 5 minutes will be fine.
// https://community.windy.com/topic/8168/report-your-weather-station-data-to-windy
bool SendToWindyCom()
{ // send info to http://stations.windy.com/stations
  WiFiClient client;
  HTTPClient http; // must be declared after WiFiClient for correct destruction order, because used by http.begin(client,...)
  String getData, Link;

  if (WiFi.status() != WL_CONNECTED)
  {
    Serial.println("wi-fi disconnected - not windy uploading");
    return false; // fail;
  }
  else if (String(windy_key).isEmpty())
  {
    Serial.println("windy not configured - skipping");
  }
  else
  { // Check WiFi connection status
    Link = "http://stations.windy.com/pws/update/" + String(windy_key) + "?name=windsurf&";

    // wind speed during interval (knots)
    if (firstWindReceived)
      getData = "winddir=" + String(CalDirection) + "&wind=" + String(WindAvr) + "&gust=" + String(WindMax, 2);

#ifdef DHTPIN
    if (!isnan(dhtT))
      getData = getData + "&temp=" + String(dhtT);
    if (!isnan(dhtH))
      getData = getData + "&rh=" + String(dhtH);
#endif
    Serial.println(Link + getData);
    http.begin(client, Link + getData); // Specify request destination
    int httpCode = http.GET();          // Send the request
    if (httpCode > 0)
    {                                    // Check the returning code
      String payload = http.getString(); // Get the request response payload
      Serial.println(payload);           // Print the response payload
      if (mqttClient.connected() && (payload.indexOf("SUCCESS") == -1))
        mqttClient.publish("debug", payload.c_str());
    }
    http.end(); // Close connection
  }

  return true; // done
}

//-------------------------------------------------------------------------------------------------------------
//////////////////////////////////// SEND TO WINDYAPP /////////////////////////////////////////////////////////
//-------------------------------------------------------------------------------------------------------------
// https://windyapp.co/apiV9.php?method=addCustomMeteostation&secret=WindyAPPSecret&d5=123&a=11&m=10&g=15&i=test1
// d5* - direction from 0 to 1024. direction in degrees is equal = (d5/1024)*360
// a* - average wind per sending interval. for m/c - divide by 10
// m* - minimal wind per sending interval. for m/c - divide by 10
// g* - maximum wind per sending interval. for m/c - divide by 10
// i* - device number

bool SendToWindyApp()
{                                   // send info to http://windy.app/
  const char *host = "windyapp.co"; // only google.com not https://google.com
  String getData = "", Link;

  if (WiFi.status() != WL_CONNECTED)
  {
    Serial.println("wi-fi connection failed");
    return false; // fail;
  }
  else if (String(windyAppID).isEmpty())
  {
    Serial.println("WindyApp not configured - skipping upload");
  }
  else
  { // Check WiFi connection status
    Link = "/apiV9.php?method=addCustomMeteostation&secret=" + String(windyAppSecret) + "&i=" + String(windyAppID) + "&";
    if (firstWindReceived)
      getData = "d5=" + String(map(CalDirection, 0, 359, 1, 1024)) + "&m=" + String(WindMin * 10, 0) + "&a=" + String(WindAvr * 10, 0) + "&g=" + String(WindMax * 10, 0);

#ifdef DHTPIN
    if (!isnan(dhtT))
      getData = getData + "&t2=" + String(dhtT);
    if (!isnan(dhtH))
      getData = getData + "&h=" + String(dhtH);
#endif
    getData.replace(" ", "");

    // Use WiFiClient class to create TCP connections
    WiFiClientSecure httpsClient;
    const int httpPort = 443;  // 80 is for HTTP / 443 is for HTTPS!
    httpsClient.setInsecure(); // this is the magical line that makes everything work
    if (!httpsClient.connect(host, httpPort))
    { // works!
      Serial.println("https connection failed");
      if (mqttClient.connected())
        mqttClient.publish("debug", "windyapp.co https connection failed");
      return false;
    }

    // We now create a URI for the request
    String url = Link + getData;

    // This will send the request to the server
    Serial.println("request sent: " + url);
    httpsClient.print(String("GET ") + url + " HTTP/1.1\r\n" +
                      "Host: " + host + "\r\n" +
                      "Connection: close\r\n\r\n");

    while (httpsClient.connected())
    {
      String line = httpsClient.readStringUntil('\n');
      if (line == "\r")
      {
        Serial.println("headers received");
        break;
      }
    }

    String payload;
    while (httpsClient.available())
    {
      payload = httpsClient.readString(); // Read Line by Line
    }
    payload.replace("\n", "/");
    Serial.println("reply was: " + payload); // Print response
    if (mqttClient.connected() && (payload.indexOf("success") == -1))
    {
      payload = getData + "> " + payload;
      mqttClient.publish("debug", payload.c_str());
    }
  }

  return true; // done
}
